str = '''

                  2022-04-06 02:43:51
                

                  218.89.67.44
                
199.96.63.177

                  btcshengyincan-sc.f2pool.com
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:51
                

                  218.89.67.44
                
67.230.169.182

                  zec.luxor.tech
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:52
                

                  218.89.67.44
                
3.121.110.28

                  eth.baypool.org
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:52
                

                  218.89.67.44
                
162.125.34.133

                  stratum443.kano.is
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:52
                

                  218.89.67.44
                
3.216.91.229

                  bch.svpool.com
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 04:35:23
                

                  218.89.67.44
                
3.121.110.28

                  asia-eth.2miners.com
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-07 20:21:54
                

                  218.89.67.44
                
176.97.68.196

                  xmr-eu1.nanopool.org
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:51
                

                  218.89.67.44
                
128.242.250.155

                  mb.poolbinance.com
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:51
                

                  218.89.67.44
                
搜 索199.59.150.13

                  ge.emcd.io
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:51
                

                  218.89.67.44
                
31.13.94.37

                  asia.ezil.me
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:52
                

                  218.89.67.44
                
108.160.167.174

                  btc-asia.luxor.tech
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 04:34:03
                

                  218.89.67.44
                
108.160.163.116

                  zec-eu.luxor.tech
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 04:34:03
                

                  218.89.67.44
                
搜 索104.244.43.57

                  sha256asicboost.br.nicehash.com
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 04:34:03
                

                  218.89.67.44
                
搜 索98.159.108.61

                  btc-va2-yb3exhtgp.ss.poolin.com
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-07 14:56:38
                

                  218.89.67.44
                
搜 索3.216.91.229

                  btcadc-us.f2pool.com
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 04:35:23
                

                  218.89.67.44
                
3.216.91.229

                  btcguobo-sc.f2pool.com
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:51
                

                  218.89.67.44
                
搜 索208.43.170.231

                  zen-eu.luxor.tech
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:51
                

                  218.89.67.44
                
搜 索199.16.156.39

                  eth.ss.poolin.com
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 04:34:03
                

                  218.89.67.44
                
搜 索104.244.46.9

                  kmd-eu.luxor.tech
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:51
                

                  218.89.67.44
                
搜 索208.43.237.140

                  nl1.kano.is
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  规则确认
        
       
                  

                  2022-04-06 02:43:52
                

                  218.89.67.44
                
搜 索128.242.240.253

                  eth-hke.flexpool.io
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:51
                

                  218.89.67.44
                
搜 索184.173.136.86

                  daggerhashimoto.eu.nicehash.com
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:51
                

                  218.89.67.44
                
搜 索69.171.224.36

                  zec.slushpool.com
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:51
                

                  218.89.67.44
                
搜 索199.96.63.177

                  btcshengyincan-sc.f2pool.com
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:51
                

                  218.89.67.44
                
搜 索67.230.169.182

                  zec.luxor.tech
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:52
                

                  218.89.67.44
                
搜 索3.121.110.28

                  eth.baypool.org
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:52
                

                  218.89.67.44
                
搜 索162.125.34.133

                  stratum443.kano.is
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:52
                

                  218.89.67.44
                
搜 索3.216.91.229

                  bch.svpool.com
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 04:35:23
                

                  218.89.67.44
                
搜 索3.121.110.28

                  asia-eth.2miners.com
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-07 20:21:54
                

                  218.89.67.44
                
搜 索176.97.68.196

                  xmr-eu1.nanopool.org
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:51
                

                  218.89.67.44
                
搜 索128.242.250.155

                  mb.poolbinance.com
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:51
                

                  218.89.67.44
                
搜 索199.59.150.13

                  ge.emcd.io
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:51
                

                  218.89.67.44
                
搜 索31.13.94.37

                  asia.ezil.me
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:52
                

                  218.89.67.44
                
搜 索108.160.167.174

                  btc-asia.luxor.tech
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 04:34:03
                

                  218.89.67.44
                
搜 索108.160.163.116

                  zec-eu.luxor.tech
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 04:34:03
                

                  218.89.67.44
                
搜 索104.244.43.57

                  sha256asicboost.br.nicehash.com
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 04:34:03
                

                  218.89.67.44
                
搜 索98.159.108.61

                  btc-va2-yb3exhtgp.ss.poolin.com
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-07 14:56:38
                

                  218.89.67.44
                
搜 索3.216.91.229

                  btcadc-us.f2pool.com
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 04:35:23
                

                  218.89.67.44
                
搜 索3.216.91.229

                  btcguobo-sc.f2pool.com
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:51
                

                  218.89.67.44
                
搜 索208.43.170.231

                  zen-eu.luxor.tech
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:51
                

                  218.89.67.44
                
搜 索199.16.156.39

                  eth.ss.poolin.com
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 04:34:03
                

                  218.89.67.44
                
搜 索104.244.46.9

                  kmd-eu.luxor.tech
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:51
                

                  218.89.67.44
                
搜 索208.43.237.140

                  nl1.kano.is
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  规则确认
        
       
                  

                  2022-04-06 02:43:52
                

                  218.89.67.44
                
搜 索128.242.240.253

                  eth-hke.flexpool.io
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:51
                

                  218.89.67.44
                
搜 索184.173.136.86

                  daggerhashimoto.eu.nicehash.com
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:51
                

                  218.89.67.44
                
搜 索69.171.224.36

                  zec.slushpool.com
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:51
                

                  218.89.67.44
                
搜 索199.96.63.177

                  btcshengyincan-sc.f2pool.com
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:51
                

                  218.89.67.44
                
搜 索67.230.169.182

                  zec.luxor.tech
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:52
                

                  218.89.67.44
                
搜 索3.121.110.28

                  eth.baypool.org
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:52
                

                  218.89.67.44
                
搜 索162.125.34.133

                  stratum443.kano.is
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:52
                

                  218.89.67.44
                
搜 索3.216.91.229

                  bch.svpool.com
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 04:35:23
                

                  218.89.67.44
                
搜 索3.121.110.28

                  asia-eth.2miners.com
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-07 20:21:54
                

                  218.89.67.44
                
搜 索176.97.68.196

                  xmr-eu1.nanopool.org
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:51
                

                  218.89.67.44
                
搜 索128.242.250.155

                  mb.poolbinance.com
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:51
                

                  218.89.67.44
                
搜 索199.59.150.13

                  ge.emcd.io
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:51
                

                  218.89.67.44
                
搜 索31.13.94.37

                  asia.ezil.me
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:52
                

                  218.89.67.44
                
搜 索108.160.167.174

                  btc-asia.luxor.tech
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 04:34:03
                

                  218.89.67.44
                
搜 索108.160.163.116

                  zec-eu.luxor.tech
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 04:34:03
                

                  218.89.67.44
                
搜 索104.244.43.57

                  sha256asicboost.br.nicehash.com
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 04:34:03
                

                  218.89.67.44
                
搜 索98.159.108.61

                  btc-va2-yb3exhtgp.ss.poolin.com
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-07 14:56:38
                

                  218.89.67.44
                
搜 索3.216.91.229

                  btcadc-us.f2pool.com
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 04:35:23
                

                  218.89.67.44
                
搜 索3.216.91.229

                  btcguobo-sc.f2pool.com
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:51
                

                  218.89.67.44
                
搜 索208.43.170.231

                  zen-eu.luxor.tech
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:51
                

                  218.89.67.44
                
搜 索199.16.156.39

                  eth.ss.poolin.com
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 04:34:03
                

                  218.89.67.44
                
搜 索104.244.46.9

                  kmd-eu.luxor.tech
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:51
                

                  218.89.67.44
                
搜 索208.43.237.140

                  nl1.kano.is
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  规则确认
        
       
                  

                  2022-04-06 02:43:52
                

                  218.89.67.44
                
搜 索128.242.240.253

                  eth-hke.flexpool.io
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:51
                

                  218.89.67.44
                
搜 索184.173.136.86

                  daggerhashimoto.eu.nicehash.com
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  

                  2022-04-06 02:43:51
                

                  218.89.67.44
                
搜 索69.171.224.36

                  zec.slushpool.com
                

                  威胁情报
                

                  其他
                

                    低危
        
      

                    失陷
                  
        
      

                  1
                
默认规则
        
       
                  人工确认
        
       
                  
'''

l = []
for i in str.split("\n"):
    for ii in i.strip():
        if(ii.islower()):
            l.append(i.strip())
            break
print(*[i for i in set(l)], sep="\n")
